In [25]:
import pandas as pd
import numpy as np

In [26]:
dataFrame = pd.read_excel("employee_sheet.xlsx")

In [27]:
dataFrame

       Employee Name            Department       Title  Salary
0       Semaj Bowers             Marketing         Mid     600
1        Gary Foster                 Sales         Mid     650
2   Saniya Maldonado                    HR         Mid     600
3     Jillian Zuniga                    HR     C-level    1000
4      Courtney Mora                 Sales         Mid     550
..               ...                   ...         ...     ...
95          Jake Gay                 Sales      Junior     443
96      Macy Webster               Finance     C-level    1250
97     Jaquan Meyers             Marketing  Mid-Senior     800
98       Willow Bush  Software Development      Junior     441
99   Emmanuel Prince                 Sales         Mid     612

[100 rows x 4 columns]

In [28]:
#1) How many rows of data are there in total?

In [29]:
len(dataFrame)
#dataFrame.count(axis = 0)

100

In [30]:
#2) What is the average salary of this company?

In [31]:
dataFrame["Salary"].mean()

725.84

In [32]:
#3) What is the average salary comparison by department in this company?

In [33]:
avg_salary_by_department = dataFrame.groupby("Department").mean("Salary")
avg_salary_by_department

                          Salary
Department
Finance               805.411765
HR                    640.937500
Marketing             707.000000
Sales                 656.666667
Software Development  826.409091

In [34]:
#4) What is the average salary comparison according to title (senior - junior) in this company?

In [237]:
avg_salary_by_title = dataFrame.groupby("Title").mean("Salary")
avg_salary_by_title

                 Salary
Title
C-level     1058.333333
Junior       440.625000
Mid          641.450000
Mid-Senior   725.500000
Senior       867.777778

In [36]:
#5) What percentage more average salary does a senior person have than a junior person?

In [269]:
((dataFrame[dataFrame["Title"]=="Senior"]["Salary"].mean()) / (dataFrame[dataFrame["Title"]=="Junior"]["Salary"].mean())-1)*100

96.94247438928292

In [13]:
#6) How much higher is the average salary of a senior person in the software development department compared to a junior person?

In [418]:
dataFrame[(dataFrame["Title"] == "Senior") & (dataFrame["Department"] == "Software Development")]["Salary"].mean() - dataFrame[(dataFrame["Title"] == "Junior") & (dataFrame["Department"] == "Software Development")]["Salary"].mean()

464.6666666666667

In [15]:
#7) How much higher is the average salary of a C-level person in the finance department than a mid-senior person?

In [368]:
dataFrame[(dataFrame["Title"] == "C-level") & (dataFrame["Department"] == "Finance")]["Salary"].mean() - dataFrame[(dataFrame["Title"] == "Mid-Senior") & (dataFrame["Department"] == "Finance")]["Salary"].mean()

240.0

In [17]:
#8) How many times more c-level employees work in the software development department than in the marketing department?

In [419]:
int(len(dataFrame[(dataFrame["Title"] == "C-level") & (dataFrame["Department"] == "Software Development")]) / len(dataFrame[(dataFrame["Title"] == "C-level") & (dataFrame["Department"] == "Marketing")]))

3